Repository: fossasia/magic-epaper-app
Catalog: lib/l10n/app_*.arb
Languages: he

source: Processing images...
he: התמונות עוברות עיבוד…

source: Product Details
he: פרטי המוצר

source: Product Image
he: תמונת המוצר

# productImageIn
source: Product Image
he: תמונת המוצר

source: Product Image Selected
he: תמונת המוצר נבחרה

source: Product Name
he: שם המוצר

source: Profile Photo
he: תמונת פרופיל

source: QR Code Data
he: נתוני קוד QR

source: Quantity/Size
he: כמות/גודל

# rawPrefix
source: Raw:
he: גולמי:

# rawPayloadLabel
source: Raw Payload:
he: מטען גולמי:

source: Reading...
he: מתבצעת קריאה…

source: Read NDEF Tags
he: קריאת תגי NDEF

source: Read NFC Tag
he: קריאת תג NFC

source: Read NFC Tags
he: קריאת תגי NFC

source: Read operation completed
he: פעולת הקריאה הושלמה

source: Read operation failed
he: פעולת הקריאה נכשלה

source: Ready to Flash
he: מוכן לצריבה

# recordPrefix
source: Record
he: רשומה

source: Record
he: רשומה

source: Records found:
he: רשומות שנמצאו:

source: Records written:
he: רשומות שנכתבו:

source: Refreshing display...
he: התצוגה מתרעננת…

source: Refresh NFC Status
he: ריענון מצב NFC

source: Rename
he: שינוי שם

source: Rename Image
he: שינוי שם התמונה

source: Renaming image...
he: שם התמונה משתנה…

source: Required
he: חובה

source: Results cleared
he: התוצאות התפנו

source: Save
he: שמירה

source: Save Image
he: שמירת תמונה

# saveImagesFromEditor
source: Save images from the editor or import new ones
he: שמירת תמונות מהעורך או ייבוא חדשות

# saveFilteredImageToLibrary
source: Save your filtered image to the library
he: שמירת התמונה המרוטשת שלך לספרייה

source: Saving image...
he: התמונה נשמרת…

source: Scan Barcode
he: סריקת ברקוד

source: Scanning for NFC tag...
he: מתבצעת סריקה לאיתור תג NFC…

source: About Us
he: עלינו

source: Developed by
he: פותח על ידי

source: FOSSASIA contributors
he: מתנדבי FOSSASIA
